#include "Main.h"

//	scene_next を使いたいので
#include "Game.h"
#include "Title.h"

//=================================================================================
//	タイトル画面の処理
//=================================================================================

//	タイトル画面で使う画像用の変数
int title_image;	//	背景画像
int name_image;		//	タイトル名画像
//	タイトル名画像のＹ座標用の変数
int name_y;

int title_waittime;
int title_countdown;

//---------------------------------------------------------------------------------
//	データの読み込み
//---------------------------------------------------------------------------------
void TitleLoad()
{
	//	画像の読み込み
	title_image = LoadGraph( "data/title_bg.bmp" );
	name_image = LoadGraph( "data/title_name.bmp" );
}
//---------------------------------------------------------------------------------
//	初期化
//---------------------------------------------------------------------------------
void TitleInit()
{
	//	初期座標の設定（名前画像が画面の上から始まるように）
	name_y = -100;
	title_waittime = 90;
	title_countdown = 300;
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void TitleUpdate()
{
	//	画面下に移動
	name_y += 3;
	//	適当なところで止める
	if( name_y > 150 ){
		name_y = 150;
	}

	if (title_countdown > 0)
	{
		title_countdown--;
	}
	else
	{
		scene_next = SCENE_STAGE;
	}

	title_waittime--;
	//	スペースキーを押したら
	if( PushHitKey( KEY_INPUT_SPACE) && title_waittime <= 0 ){
		//	次に行きたいシーン番号を設定します（後で話が出てきます）
		scene_next = SCENE_STAGE;
	}
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void TitleRender()
{
	//	背景画像の描画
	DrawGraph( 0, 0, title_image, TRUE );
	//	タイトル名画像の描画
	DrawRotaGraph( SCREEN_W / 2, name_y, 1.0f, 0.0f, name_image, TRUE );

	DrawString( 20, 20, "【タイトル画面】", GetColor( 255, 255, 255 ) );
	DrawString( 20, 40, "スペースキーでステージへ（「ゲームタイトル」が下りてくるまでは押しても行かない）", GetColor( 255, 255, 0 ) );

	DrawString( 20, 60, "スペースキーを押さなくても一定時間たったらステージへ", GetColor( 255, 255, 0 ) );
	DrawFormatString( 20, 80, GetColor(255, 255, 0) , "残りタイトル画面時間 : %d", title_countdown);
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void TitleExit()
{
	DeleteGraph( title_image );
}
