#include "Main.h"
#include "Game.h"
#include "Random.h"
#include "Float2.h"
#include "Hit.h"

//	文字列の行数
#define LINE_MAX	5

//	テキストから取得した文字列を入れる用の変数
char draw_text[LINE_MAX][256];

//	テキストから取得した色の値を入れる用の変数
int color_r[LINE_MAX];
int color_g[LINE_MAX];
int color_b[LINE_MAX];

//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void GameInit()
{
	//	ファイルを開く
	FILE *fp = fopen( "data/sample.txt", "r" );
	if( fp ){
		//	最初の１行目からは色情報を取得する
		char text[256];
		//	１行取得
		fgets( text, 256, fp );
		//	この文字列を数値に分けて変数に設定
		sscanf_s( text, "%d,%d,%d", &color_r, &color_g, &color_b );

		//	行数分くり返す
		for( int i = 0; i < LINE_MAX; i++ ){
			//	１行取得して用意した変数に入れる
			sscanf_s(text, "%d,%d,%d", &color_r[i], &color_g[i], &color_b[i]);
			fgets( draw_text[i], 256, fp );
			fgets(text, 256, fp);
		}

		//	ファイルを閉じる
		fclose( fp );
	}
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void GameUpdate()
{
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void GameRender()
{
	//	文字列の描画
	for( int i = 0; i < LINE_MAX; i++ ){
		//	取得した色の設定
		int r = color_r[i];
		int g = color_g[i];
		int b = color_b[i];
		if (r == -1) { r = GetRand(256); }
		if (g == -1) { g = GetRand(256); }
		if (b == -1) { b = GetRand(256); }
		//	その色で取得した文字列を描画
		DrawString( 100, 100 + 20 * i, draw_text[i], GetColor( r, g, b ) );
	}

	DrawString( 16, 16, "テキストファイルの文字列の描画", GetColor( 255, 255, 255 ) );
	DrawString( 16, 32, "文字列ごとに色情報を使って描画色の設定", GetColor( 255, 255, 0 ) );
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void GameExit()
{
}
