#include "Main.h"
#include "Game.h"
#include "Random.h"
#include "Npc.h"

#define NPC_SPEED	3.0f

//---------------------------------------------------------------------------------
//	èâä˙âªèàóù
//---------------------------------------------------------------------------------
void Npc::Init(int image)
{
	m_image = image;

	m_pos.x = GetRandomF( SCREEN_W );
	m_pos.y = GetRandomF( SCREEN_H );

	m_rot = 180.0f;

	m_type = TYPE_NONE;
}
//---------------------------------------------------------------------------------
//	çXêVèàóù
//---------------------------------------------------------------------------------
void Npc::Update()
{
	switch (m_type)
	{
	case TYPE_NONE:
		break;
	case TYPE_LEFT:
		m_pos.x -= NPC_SPEED;
		break;
	}
}
//---------------------------------------------------------------------------------
//	ï`âÊèàóù
//---------------------------------------------------------------------------------
void Npc::Render()
{
	DrawRotaGraphF( m_pos.x, m_pos.y, 1.0f, TO_RADIAN( m_rot ), m_image, TRUE );
}
//---------------------------------------------------------------------------------
//	èIóπèàóù
//---------------------------------------------------------------------------------
void Npc::Exit(int image)
{
	DeleteGraph(image);
}
