#include "Main.h"
#include "Game.h"
#include "Float2.h"
#include "Hit.h"
#include "Random.h"
#include "Npc.h"
#include "Player.h"

Player player;
Npc npc;
//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void GameInit()
{
	player.Init();
	npc.Init();
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void GameUpdate()
{
	player.Update();
	npc.Update();

	if (CheckCircleHit(player.pos,player.radius, npc.m_pos,npc.radius))
	{
		npc.Randomize();
	}
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void GameRender()
{
	player.Render();
	npc.Render();

	DrawString( 16, 16, "クラスで実装", GetColor( 255, 255, 255 ) );
	DrawString( 16, 32, "十字キー：プレイヤー移動", GetColor( 255, 255, 255 ) );
	DrawString( 16, 48, "ＮＰＣは画面内にランダムに配置して開始", GetColor( 255, 255, 255 ) );
	DrawString( 16, 64, "プレイヤーとＮＰＣで当たり判定 → 当たったら画面内にランダムに配置", GetColor( 255, 255, 255 ) );
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void GameExit()
{
	player.Exit();
	npc.Exit();
}
