#include "Main.h"
#include "Game.h"
#include "Player.h"

//	プレイヤーの移動スピード
#define PLAYER_SPEED	5.0f

//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void Player::Init( int image )
{
	m_image = image;

	m_pos.x = 100.0f;
	m_pos.y = 250.0f;
	m_rot = 0.0f;
	//	元々の移動スピードで開始
	m_speed = PLAYER_SPEED;
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void Player::Update()
{
	//	十字キーで座標移動（ポーズメニューで変更されるスピードで移動）
	if( CheckHitKey( KEY_INPUT_RIGHT ) ){
		m_pos.x += m_speed;
	}
	if( CheckHitKey( KEY_INPUT_LEFT ) ){
		m_pos.x -= m_speed;
	}
	if( CheckHitKey( KEY_INPUT_DOWN ) ){
		m_pos.y += m_speed;
	}
	if( CheckHitKey( KEY_INPUT_UP ) ){
		m_pos.y -= m_speed;
	}
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void Player::Render()
{
	DrawRotaGraphF( m_pos.x, m_pos.y, 1.0f, TO_RADIAN( m_rot ), m_image, TRUE );
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void Player::Exit()
{
}
