#include "Main.h"
#include "Game.h"
#include "Random.h"
#include "Npc.h"

//	回転スピード
#define NPC_ROT_SPEED	2.0f

//---------------------------------------------------------------------------------
//	ＮＰＣの初期化処理
//---------------------------------------------------------------------------------
void Npc::Init()
{
	//	ＮＰＣ画像の読み込み
	m_image = LoadGraph( "data/npc.bmp" );

//	m_pos.x = GetRandomF( SCREEN_W );
//	m_pos.y = GetRandomF( SCREEN_H );
	//	座標を蘭d舞うに設定する関数
	SetRandom();
}
//---------------------------------------------------------------------------------
//	ＮＰＣの更新処理
//---------------------------------------------------------------------------------
void Npc::Update()
{
	rotation += NPC_ROT_SPEED;
}
//---------------------------------------------------------------------------------
//	ＮＰＣの描画処理
//---------------------------------------------------------------------------------
void Npc::Render()
{
	//	更新処理で動かした座標（ m_pos ）の場所に画像（ m_image ）を描画
	DrawRotaGraphF( m_pos.x, m_pos.y, 1.0f, TO_RADIAN( rotation ), m_image, TRUE );
}
//---------------------------------------------------------------------------------
//	ＮＰＣの終了処理
//---------------------------------------------------------------------------------
void Npc::Exit()
{
	//	読み込んだ画像の終了処理
	DeleteGraph( m_image );
}

//---------------------------------------------------------------------------------
//	座標をランダムに設定する関数
//---------------------------------------------------------------------------------
void Npc::SetRandom()
{
	//	座標を画面内のランダムに
	m_pos.x = GetRandomF( SCREEN_W );
	m_pos.y = GetRandomF( SCREEN_H );
	rotation = GetRandomF(360);
}
