#include "Main.h"
#include "Game.h"
#include "Random.h"
#include "Npc.h"

//	移動スピード
#define NPC_SPEED	3.0f

//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void Npc::Init( int image )
{
	//	画像の読み込み
//	m_image = LoadGraph( "data/npc.bmp" );
	//	渡された番号を受け取る
	m_image = image;

	//	座標をランダムに設定
	m_pos.x = GetRandomF( SCREEN_W );
	m_pos.y = GetRandomF( SCREEN_H );
	//	向きの設定
	m_rot = 180.0f;
	//	最初は何もしない状態から開始
	m_type = TYPE_NONE;
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void Npc::Update()
{
	switch( m_type ){
	case TYPE_NONE:
		//	何もしない
		break;

	case TYPE_LEFT:
		//	画面左に移動
		m_pos.x -= NPC_SPEED;
		break;
	case TYPE_RIGHT:
		//	画面左に移動
		m_pos.x += NPC_SPEED*2;
		m_rot = 0;
		break;
	}
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void Npc::Render()
{
	//	何もしないときは表示もしない
	if( m_type == TYPE_NONE )	return;

	DrawRotaGraphF( m_pos.x, m_pos.y, 1.0f, TO_RADIAN( m_rot ), m_image, TRUE );
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void Npc::Exit()
{
}
