#include "Main.h"
#include "Game.h"
#include "Player.h"

//---------------------------------------------------------------------------------
//	èâä˙âªèàóù
//---------------------------------------------------------------------------------
void Player::Init( int image )
{
	m_image = image;

	m_pos.x = 100.0f;
	m_pos.y = 250.0f;
	m_rot = 0.0f;
}
//---------------------------------------------------------------------------------
//	çXêVèàóù
//---------------------------------------------------------------------------------
void Player::Update()
{
	Base::Update();
	if( CheckHitKey( KEY_INPUT_RIGHT ) ){
		m_pos.x += m_speed;
	}
	if( CheckHitKey( KEY_INPUT_LEFT ) ){
		m_pos.x -= m_speed;
	}
	if( CheckHitKey( KEY_INPUT_DOWN ) ){
		m_pos.y += m_speed;
	}
	if( CheckHitKey( KEY_INPUT_UP ) ){
		m_pos.y -= m_speed;
	}
}
//---------------------------------------------------------------------------------
//	ï`âÊèàóù
//---------------------------------------------------------------------------------
void Player::Render()
{
	DrawRotaGraphF( m_pos.x, m_pos.y, 1.0f, TO_RADIAN( m_rot ), m_image, TRUE );
}
//---------------------------------------------------------------------------------
//	èIóπèàóù
//---------------------------------------------------------------------------------
void Player::Exit()
{
}
